[
  {
    "avg_para_length": 4,
    "id": "41",
    "avg_speech_length": 64,
    "avg_sent_length": 19,
    "preambles": [
      "Mr. Speaker and Mr. President, distinguished Members of Congress, honored guests, and fellow citizens:",
      "Mr. President, Mr. Speaker, Members of the United States Congress:",
      "Mr. President and Mr. Speaker and Members of the United States Congress:",
      "Mr. Speaker, Mr. President, and distinguished Members of the House and Senate, honored guests, and fellow citizens:"
    ],
    "name": "George Bush"
  },
  {
    "avg_para_length": 4,
    "id": "43",
    "avg_speech_length": 68,
    "avg_sent_length": 20,
    "preambles": [
      "Mr. Speaker, Vice President Cheney, Members of Congress, distinguished guests, and fellow citizens:",
      "Mr. Speaker, Vice President Cheney, Members of Congress, fellow citizens:",
      "Thank you very much. Mr. Speaker, Vice President Cheney, Members of Congress, distinguished guests, fellow citizens:",
      "Mr. Speaker, Vice President Cheney, Members of Congress, distinguished guests, and fellow citizens:",
      "Thank you very much. And tonight I have the high privilege and distinct honor of my own as the first President to begin the State of the Union message with these words: Madam Speaker.",
      "Thank you all. Mr. Speaker, Vice President Cheney, Members of Congress, members of the Supreme Court and diplomatic corps, distinguished guests, and fellow citizens:",
      "Mr. Speaker, Mr. Vice President, Members of Congress:",
      "Thank you all. Madam Speaker, Vice President Cheney, Members of Congress, distinguished guests, and fellow citizens:"
    ],
    "name": "George W. Bush"
  },
  {
    "id": "44",
    "avg_para_length": 4,
    "avg_sent_length": 20,
    "avg_speech_length": 93,
    "preambles": [
      "Madam Speaker, Vice President Biden, Members of Congress, distinguished guests, and fellow Americans:",
      "Mr. Speaker, Mr. Vice President, Members of Congress, distinguished guests, and fellow Americans:",
      "Please, everybody, have a seat. Mr. Speaker, Mr. Vice President, Members of Congress, fellow Americans:",
      "Madam Speaker, Mr. Vice President, Members of Congress, the First Lady of the United States--she's around here somewhere:",
      "Mr. Speaker, Mr. Vice President, Members of Congress, distinguished guests, and fellow Americans:",
      "Mr. Speaker, Mr. Vice President, Members of Congress, my fellow Americans"
    ],
    "name": "Barack Obama"
  },
  {
    "avg_para_length": 5,
    "id": "26",
    "avg_speech_length": 115,
    "avg_sent_length": 33,
    "preambles": [
      "To the Senate and House of Representatives:",
      "To the Senate and House of Representatives:"
    ],
    "name": "Theodore Roosevelt"
  },
  {
    "avg_para_length": 3,
    "id": "16",
    "avg_speech_length": 66,
    "avg_sent_length": 31,
    "preambles": [
      "Fellow-Citizens of the Senate and House of Representatives:",
      "Fellow-Citizens of the Senate and House of Representatives:"
    ],
    "name": "Abraham Lincoln"
  },
  {
    "avg_para_length": 4,
    "id": "42",
    "avg_speech_length": 97,
    "avg_sent_length": 21,
    "preambles": [
      "Mr. President, Mr. Speaker, Members of the House and the Senate, distinguished Americans here as visitors in this Chamber, as am I.",
      "Thank you very much. Mr. Speaker, Mr. Vice President, Members of the 104th Congress, distinguished guests, my fellow Americans all across our land:",
      "Mr. Speaker, Mr. Vice President, Members of Congress, honored guests, my fellow Americans:",
      "Mr. Speaker, Mr. Vice President, Members of the 105th Congress, distinguished guests, and my fellow Americans:",
      "Mr. Speaker, Mr. Vice President, Members of the 105th Congress, distinguished guests, my fellow Americans:",
      "Mr. President, Mr. Speaker, Members of the 104th Congress, my fellow Americans: Again we are here in the sanctuary of democracy, and once again our democracy has spoken.",
      "Mr. Speaker, Mr. Vice President, Members of Congress, honored guests, my fellow Americans:",
      "Thank you very much. Mr. Speaker, Mr. President, Members of the 103d Congress, my fellow Americans:"
    ],
    "name": "William J. Clinton"
  },
  {
    "avg_para_length": 2,
    "id": "01",
    "avg_speech_length": 28,
    "avg_sent_length": 37,
    "preambles": [
      "Fellow-Citizens of the Senate and House of Representatives:",
      "Fellow-Citizens of the Senate and House of Representatives:"
    ],
    "name": "George Washington"
  },
  {
    "avg_para_length": 3,
    "id": "40",
    "avg_speech_length": 61,
    "avg_sent_length": 22,
    "preambles": [
      "Mr. Speaker, Mr. President, distinguished Members of the Congress, honored guests, and fellow citizens:",
      "Mr. Speaker, Mr. President, distinguished Members of the Congress, honored guests, and fellow citizens:",
      "Mr. Speaker, Mr. President, distinguished Members of the Congress, honored guests, and fellow citizens:",
      "Mr. Speaker, Mr. President, distinguished Members of the Congress, honored guests, and fellow citizens:",
      "Mr. Speaker, Mr. President, distinguished Members of the Congress, honored guests, and fellow citizens:",
      "Mr. Speaker, Mr. President, distinguished Members of Congress, honored guests, and fellow citizens:",
      "Mr. Speaker, Mr. President, and distinguished Members of the House and Senate:",
      "Mr. Speaker, Mr. President, distinguished Members of Congress, honored guests, and fellow citizens:"
    ],
    "name": "Ronald Reagan"
  },
  {
    "avg_para_length": 2,
    "id": "03",
    "avg_speech_length": 22,
    "avg_sent_length": 41,
    "preambles": [
      "The Senate and House of Representatives of the United States:",
      "To The Senate and House of Representatives of the United States:",
      "Fellow Citizens of the Senate and House of Representatives:",
      "The Senate and House of Representatives of the United States:",
      "The Senate and House of Representatives of the United States:",
      "The Senate and House of Representatives of the United States:",
      "To the Senate and House of Representatives:",
      "The Senate and House of Representatives of the United States:"
    ],
    "name": "Thomas Jefferson"
  }
]
